backend/controllers/SiteController.php

SELECT COUNT(id) FROM `yii2_article` WHERE `type`=0
SELECT COUNT(id) FROM `yii2_comment`
SELECT COUNT(id) FROM `yii2_user`
SELECT COUNT(id) FROM `yii2_friendly_link`
---
                'PERCENTAGE' => $serverInfo['memRealPercent'] . '%',
            ],
        ];
        $temp = [
            'ARTICLE' => ArticleModel::find()->where(['type' => ArticleModel::ARTICLE])->count('id'),
            'COMMENT' => Comment::find()->count('id'),
            'USER' => User::find()->count('id'),
            'FRIEND_LINK' => FriendlyLink::find()->count('id'),
        ];

SELECT COUNT(id) FROM `yii2_article` WHERE `created_at` BETWEEN 1551369600 AND 1554047999
SELECT COUNT(id) FROM `yii2_comment` WHERE `created_at` BETWEEN 1552579200 AND 1552613218
---
        $statics = [
            'ARTICLE' => [
                $temp['ARTICLE'],
                $temp['ARTICLE'] ? number_format(ArticleModel::find()->where([
                        'between',
                        'created_at',
                        strtotime(date('Y-m-01')),
                        strtotime(date('Y-m-01 23:59:59') . " +1 month -1 day")
                    ])->count('id') / $temp['ARTICLE'] * 100, 2) : $percent
            ],
            'COMMENT' => [
                $temp['COMMENT'],
                $temp['COMMENT'] ? number_format(Comment::find()->where([
                        'between',
                        'created_at',
                        strtotime(date('Y-m-d 00:00:00')),
                        time()
                    ])->count('id') / $temp['COMMENT'] * 100, 2) : $percent

SELECT COUNT(id) FROM `yii2_friendly_link` WHERE `created_at` BETWEEN 1551369600 AND 1554047999
---
            ],
            'FRIEND_LINK' => [
                $temp['FRIEND_LINK'],
                $temp['FRIEND_LINK'] ? number_format(FriendlyLink::find()->where([
                        'between',
                        'created_at',
                        strtotime(date('Y-m-01')),
                        strtotime(date('Y-m-01 23:59:59') . " +1 month -1 day")
                    ])->count('id') / $temp['FRIEND_LINK'] * 100, 2) : $percent