frontend/views/article/index.php

            <div class="ws_shadow"></div>
        </div>
        <div class="daodu clr">
            <?= ArticleListView::widget([
                'dataProvider' => new ArrayDataProvider([
                    'allModels' => Article::find()->limit(1)->where(['flag_headline'=>1])->limit(4)->with('category')->orderBy("sort asc")->all(),
                ]),
                'layout' => "<div class='tip'><h4>" . Yii::t('frontend', 'Well-choosen') . "</h4></div>
                                <ul class=\"dd-list\">
                                    {items}
                                </ul>
                             ",
                'template' => "<figure class='dd-img'>
                                        <a title='{title}' target='_blank' href='{article_url}'>
                                            <img src='{img_url}' style='display: inline;' alt='{title}'>
                                        </a>
                                    </figure>
                                    <div class='dd-content'>
                                        <h2 class='dd-title'>
                                            <a rel='bookmark' title='{title}' href='{article_url}'>{title}</a>
                                        </h2>
                                        <div class='dd-site xs-hidden'>{summary}</div>
                                    </div>",
                'itemOptions' => ['tag'=>'li'],
                'thumbWidth' => 168,
                'thumbHeight' => 112,
---
SELECT * FROM `yii2_article` WHERE `flag_headline`=1 ORDER BY `sort` LIMIT 4
SELECT * FROM `yii2_category` WHERE `id` IN ('1', '2')