frontend/controllers/ArticleController.php

    public function behaviors()
    {
        return [
            [
                'class' => HttpCache::className(),
                'only' => ['view'],
                'lastModified' => function ($action, $params) {
                    $id = Yii::$app->getRequest()->get('id');
                    $model = Article::findOne(['id' => $id, 'type' => Article::ARTICLE, 'status' => Article::ARTICLE_PUBLISHED]);
                    if( $model === null ) throw new NotFoundHttpException(Yii::t("frontend", "Article id {id} is not exists", ['id' => $id]));
                    Article::updateAllCounters(['scan_count' => 1], ['id' => $id]);
---
SELECT * FROM `yii2_article` WHERE (`id`='3') AND (`type`=0) AND (`status`=1)
UPDATE `yii2_article` SET `scan_count`=`scan_count`+1 WHERE `id`='3'

    public function actionIndex($cat = '')
    {
        if ($cat == '') {
            $cat = Yii::$app->getRequest()->getPathInfo();
        }
        $where = ['type' => Article::ARTICLE, 'status' => Article::ARTICLE_PUBLISHED];
        if ($cat != '' && $cat != 'index') {
            if ($cat == Yii::t('app', 'uncategoried')) {
                $where['cid'] = 0;
            } else {
                if (! $category = Category::findOne(['alias' => $cat])) {
---
SELECT * FROM `yii2_category` WHERE `alias`='toastr.js.map'

    public function actionView($id)
    {
        $model = Article::findOne(['id' => $id, 'type' => Article::ARTICLE, 'status' => Article::ARTICLE_PUBLISHED]);
        if( $model === null ) throw new NotFoundHttpException(Yii::t("frontend", "Article id {id} is not exists", ['id' => $id]));
        $prev = Article::find()
            ->where(['cid' => $model->cid])
            ->andWhere(['>', 'id', $id])
            ->orderBy("sort asc,created_at desc,id desc")
            ->limit(1)
            ->one();
        $next = Article::find()
            ->where(['cid' => $model->cid])
            ->andWhere(['<', 'id', $id])
            ->orderBy("sort desc,created_at desc,id asc")
            ->limit(1)
            ->one();//->createCommand()->getRawSql();
        $commentModel = new Comment();
        $commentList = $commentModel->getCommentByAid($id);
        $recommends = Article::find()
            ->where(['type' => Article::ARTICLE, 'status' => Article::ARTICLE_PUBLISHED])
            ->andWhere(['<>', 'thumb', ''])
            ->orderBy("rand()")
            ->limit(8)
            ->with('category')
            ->all();
---
SELECT * FROM `yii2_article` WHERE (`id`='3') AND (`type`=0) AND (`status`=1)
SELECT * FROM `yii2_article` WHERE (`cid`='1') AND (`id` > '3') ORDER BY `sort`, `created_at` DESC, `id` DESC LIMIT 1
SELECT * FROM `yii2_article` WHERE (`cid`='1') AND (`id` < '3') ORDER BY `sort` DESC, `created_at` DESC, `id` LIMIT 1
SELECT * FROM `yii2_article` WHERE ((`type`=0) AND (`status`=1)) AND (`thumb` <> '') ORDER BY rand() LIMIT 8
SELECT * FROM `yii2_category` WHERE `id` IN ('2', '3', '1')

    public function actionViewAjax($id)
    {
        $model = Article::findOne($id);
---
SELECT * FROM `yii2_article` WHERE `id`='3'