common/models/Category.php

    protected static function _getCategories()
    {
        return self::find()->orderBy("sort asc,parent_id asc")->asArray()->all();
---
SELECT * FROM `yii2_category` ORDER BY `sort`, `parent_id`