common/models/Comment.php

    public function getCommentByAid($id)
    {
        $list = self::find()
            ->where(['aid' => $id, 'status' => self::STATUS_PASSED])
            ->orderBy("id desc,reply_to desc")
            ->all();
---
SELECT * FROM `yii2_comment` WHERE (`aid`='3') AND (`status`=1) ORDER BY `id` DESC, `reply_to` DESC