common/models/Options.php

SELECT * FROM `yii2_options` WHERE (`type`=2) AND (`name`='index') AND (`autoload`=1)
---
    public static function getBannersByType($name)
    {
        $model = Options::findOne(['type'=>self::TYPE_BANNER, 'name'=>$name, 'autoload'=>Constants::Status_Enable]);

SELECT * FROM `yii2_options` WHERE (`type`=3) AND (`name`='sidebar_right_1')
---
    public static function getAdByName($name)
    {
        $ad = AdForm::findOne(['type'=>self::TYPE_AD, 'name'=>$name]);