frontend/views/widgets/_sidebar.php

SELECT * FROM `yii2_article` WHERE `flag_special_recommend`=1 ORDER BY `sort` LIMIT 8
---
        </div>
        <ul>
            <?php
            $articles = Article::find()->where(['flag_special_recommend' => 1])->limit(8)->orderBy("sort asc")->all();

SELECT * FROM `yii2_comment` ORDER BY `id` DESC LIMIT 5
---
        </div>
        <ul>
            <?php
            $comments = Comment::find()->orderBy("id desc")->limit(5)->all();

SELECT * FROM `yii2_friendly_link` WHERE `status`=1 ORDER BY `sort`, `id`
---
        <div class="textwidget">
            <div class="d_tags_1">
                <?php
                $links = FriendlyLink::find()->where(['status' => FriendlyLink::DISPLAY_YES])->orderBy("sort asc, id asc")->asArray()->all();