backend/models/Comment.php

SELECT * FROM `yii2_article` WHERE `id` IN ('21', '12', '22')
SELECT * FROM `yii2_comment` ORDER BY `created_at` DESC LIMIT 6
---
    public static function getRecentComments($limit = 10)
    {
        return self::find()->orderBy('created_at desc')->with('article')->limit($limit)->all();