backend/models/Menu.php

    public static function getBackendMenu()
    {
        $model = new self();
        $menus = $model->find()->where(['is_display' => self::DISPLAY_YES, 'type' => self::BACKEND_TYPE])->orderBy("sort asc")->all();
---
SELECT * FROM `yii2_menu` WHERE (`is_display`=1) AND (`type`=0) ORDER BY `sort`